Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-14 Wed 17:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 5: Document Object Model</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Chapter 5: Document Object Model</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfcd665a">Navigation</a></li>
<li><a href="#org50114d7">Notes</a>
<ul>
<li><a href="#org1945c83">Section 5.1: Introduction</a></li>
<li><a href="#orgc75c2a4">Section 5.2: DOM Tree</a></li>
<li><a href="#org75997c4">Section 5.3: Working with the DOM Tree</a>
<ul>
<li><a href="#orga251a44">Section 5.3.1: Locating / Retrieving the Elements</a></li>
<li><a href="#org0f4daf6">Section 5.3.2: Use / Update the Elements</a></li>
</ul>
</li>
<li><a href="#orgfe7c72d">Section 5.4: Security Risks</a>
<ul>
<li><a href="#orgfe361c8">Section 5.4.1: Defending Against Cross-Site Scripting</a></li>
<li><a href="#org37fa7e3">Section 5.4.2: Validation &amp; Templates</a></li>
<li><a href="#org049bd77">Section 5.4.3: Escaping &amp; Controlling Markup</a></li>
</ul>
</li>
<li><a href="#org31df57e">Section 5.5: Attribute Nodes</a></li>
<li><a href="#orgd323293">Section 5.6: Chapter Exercise</a></li>
<li><a href="#org6371e74">Section 5.7: Summary</a></li>
</ul>
</li>
<li><a href="#org8310c0b">Keywords</a></li>
<li><a href="#orgac53bab">Questions</a></li>
<li><a href="#orgf0cf0ba">Summary</a></li>
<li><a href="#org6acee77">Resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfcd665a" class="outline-2">
<h2 id="orgfcd665a">Navigation</h2>
<div class="outline-text-2" id="text-orgfcd665a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../../../index.html">html</a> &vert; <a href="../../../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">JavaScript &amp; JQuery - Interactive Front-end Web Development</td>
<td class="org-left">&vert; <a href="../000.Home.html">html</a> &vert; <a href="../000.Home.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Prev</td>
<td class="org-left">Chapter 4: Decisions &amp; Loops</td>
<td class="org-left">&vert; <a href="../004.Decisions_and_Loops/004.000.Notes.html">html</a> &vert; <a href="../004.Decisions_and_Loops/004.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/004.Decisions_and_Loops">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Next</td>
<td class="org-left">Chapter 6: Events</td>
<td class="org-left">&vert; <a href="../006.Events/006.000.Notes.html">html</a> &vert; <a href="../006.Events/006.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/006.Events">github</a> &vert;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org50114d7" class="outline-2">
<h2 id="org50114d7">Notes</h2>
<div class="outline-text-2" id="text-org50114d7">
</div>
<div id="outline-container-org1945c83" class="outline-3">
<h3 id="org1945c83">Section 5.1: Introduction</h3>
<div class="outline-text-3" id="text-org1945c83">
<ul class="org-ul">
<li>The Document Object Model (DOM) specifies how browsers should create a model of an HTML page and how JavaScript can access and update the contents of a web page while it is in the browser window</li>
<li>The DOM is neither part of HTML nor poart of JavaScript instead it is a separate set of rules that is implemented by all major browsers and covers two areas: making a model of the HTML page and accessing and changing the HTML page</li>
<li>When the browser loads a web page it creates a model of the page in memory and DOM specifies the way in which the browser should structure this model using a DOM tree</li>
<li>DOM is called an object model because the model (the DOM tree) is a made of objects and each object represents a different part of the page loaded in the browser window</li>
<li>DOM also defines methods and properties to access and update each object in the DOM tree which in turn updates what the user sees in the browser</li>
<li>DOM is sometimes referred to as an application programming interface (API)</li>
<li>Using the API your script can ask the browser about the current page and how to tell the browser to update what is being shown to the user</li>
</ul>
</div>
</div>
