Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.org
** Section 5.2: DOM Tree
   - As a browser loads a web page, it creates a model of that page and the model is called a DOM tree
   - The DOM tree is stored in the browsers' memory and it consists of four main types of nodes:
     - Document node (root node)
     - Element nodes (e.g. h1, h2, li, ul, etc.)
     - Attribute nodes (e.g. attribute belonging to h1)
     - Text nodes (text within the element)
   - Every element, attribute, and piece of text in HTML is represented by its own DOM node
   - The root of the tree is the document node and it represents the entire page
   - The root node is the document node which is the document object we have discussed in previous chapters
   - Let's take the following HTML:

   #+BEGIN_SRC html
     <!DOCTYPE html>
     <html>
       <head>
	 <title>Example</title>
       </head>
       <body>
	 <h1 id="heading">Heading</h1>
       </body>
     </html>
   #+END_SRC

   - The example above will produce a tree like the following:

   #+BEGIN_SRC text
     document
     |- html
     |  |- head
     |  |  |- text: "\n"
     |  |  |- title
     |  |     |- text: "Example"
     |  |  |- text: "\n"
     |  |- text: "\n"
     |  |- body
     |  |  |- text: "\n"
     |  |  |- h1
     |  |     |- attribute: id
     |  |     |- text: "Heading"
     |  |  |- "text: "\n" 
   #+END_SRC

   - Notice the root of the dom tree is the document object
   - *Every tree node is an object even the leaf nodes*
   - The root node is the document object
   - Then we have the element nodes which are element objects (objects that use the ~Element~ interface)
   - Then we have the text nodes which are text objects (objects that use the ~Text~ interface)
   - The fourth node are the attribute nodes which are attribute objects (objects that use the ~Attr~ interface)
   - These are the main 4 nodes in a DOM tree but there are 11 types of nodes in the DOM tree:
     1. Document Node
     2. Element Node
     3. Attribute Node
     4. Text Node
     5. CDATA Section Node
     6. Entity Reference Node
     7. Entity Node
     8. Processing Instruction Node
     9. Comment Node
     10. Document Type Node
     11. Document Fragment Node
   - There are some things to note however
   - Typically the leaf nodes include text nodes, comment nodes, and CDATA section nodes
   - Attribute nodes are *not* considered leaf nodes because attribute nodes are *not* considered to be part of the main DOM tree hierarchy like element or text nodes
   - Instead attribute nodes are "associated" with element nodes and held separately as part of the element's "NamedNodeMap"
   - The DOM tree represents parent-child relationships and attribute nodes are properties of elements, thus attributes are not children of the elements but properties (attributes) that exist on the element node
   - This is why attributes will not appear in the ~childNodes~ of an element and you can access the attributes using the element's property called ~attributes~
   - Another thing to note is that spaces and newlines are valid characters and become part of the DOM tree
   - Any character including whitespace, newlines, tabs, etc. that are inside an element will be part of the DOM tree as text objects under the element node as shown in the example above
   - There are only two exceptions and that is whitespace characters before the element ~<head>~ are ignored and white space after the closing body tag (~</body>~) are automatically moved inside the body
   - Other than those exceptions every whitespace characters are placed into the DOM tree as text objects

   - Going back to the main nodes, the document node is the starting point for all visits to the DOM tree so when you access any element, attribute or text node you navigate to that node via the ~document~ node
   - HTML elements describe the structure of an HTML page so to access the DOM tree you start by looking for elements (via the document node) and once you find the element you want then you can access its text and attribute nodes
   - Thus you go from document node then you use some methods to find the element nodes and then you use methods / properties to find the text and attributes of the element you want to modify
   - HTML elements can carry attributes and these are represented by the attribute nodes in the DOM tree
   - Attribute nodes are *not* children of the element that carries them instead they *are part* of that element
   - Once you access an element there are specific JavaScript methods and properties to read or change that element's attributes
   - Once you have accessed an element node, you can can then reach the text within that element and this is stored in its own text node
   - Text nodes cannot have children and thus text nodes are leaf nodes
   - So if an element contains a text node *and* another child element, the other child element is *not* a child of the text node but rather a sibling of the text node and a child of the containing element
   - Thus relationships between the ~document~ and all of the element nodes are described using the same terms as a family tree: parents, children, siblings, ancestors, and descendents (so every node is technically a descendant of the ~document~ node)
   - Finally, each node is an object with methods and properties so scripts can access and update the DOM tree (not the source HTML file) but the DOM tree structure and any changes made to the DOM tree are reflected in the browser

** Section 5.3: Working with the DOM Tree
   - Accessing and updating the DOM tree involves two steps:
     1. Locate the node that represents the element you want to work with
     2. Use its text content, child elements, and attributes

