Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.html

<div id="outline-container-orgc75c2a4" class="outline-3">
<h3 id="orgc75c2a4">Section 5.2: DOM Tree</h3>
<div class="outline-text-3" id="text-orgc75c2a4">
<ul class="org-ul">
<li>As a browser loads a web page, it creates a model of that page and the model is called a DOM tree</li>
<li>The DOM tree is stored in the browsers' memory and it consists of four main types of nodes:
<ul class="org-ul">
<li>Document node (root node)</li>
<li>Element nodes (e.g. h1, h2, li, ul, etc.)</li>
<li>Attribute nodes (e.g. attribute belonging to h1)</li>
<li>Text nodes (text within the element)</li>
</ul></li>
<li>Every element, attribute, and piece of text in HTML is represented by its own DOM node</li>
<li>The root of the tree is the document node and it represents the entire page</li>
<li>The root node is the document node which is the document object we have discussed in previous chapters</li>
<li>Let's take the following HTML:</li>
</ul>

<div class="org-src-container">
<pre class="src src-html">&lt;!DOCTYPE html&gt;
&lt;html&gt;
  &lt;head&gt;
    &lt;title&gt;Example&lt;/title&gt;
  &lt;/head&gt;
  &lt;body&gt;
    &lt;h1 id="heading"&gt;Heading&lt;/h1&gt;
  &lt;/body&gt;
&lt;/html&gt;
</pre>
</div>

<ul class="org-ul">
<li>The example above will produce a tree like the following:</li>
</ul>

<div class="org-src-container">
<pre class="src src-text">document
|- html
|  |- head
|  |  |- text: "\n"
|  |  |- title
|  |     |- text: "Example"
|  |  |- text: "\n"
|  |- text: "\n"
|  |- body
|  |  |- text: "\n"
|  |  |- h1
|  |     |- attribute: id
|  |     |- text: "Heading"
|  |  |- "text: "\n" 
</pre>
</div>

<ul class="org-ul">
<li>Notice the root of the dom tree is the document object</li>
<li><b>Every tree node is an object even the leaf nodes</b></li>
<li>The root node is the document object</li>
<li>Then we have the element nodes which are element objects (objects that use the <code>Element</code> interface)</li>
<li>Then we have the text nodes which are text objects (objects that use the <code>Text</code> interface)</li>
<li>The fourth node are the attribute nodes which are attribute objects (objects that use the <code>Attr</code> interface)</li>
<li>These are the main 4 nodes in a DOM tree but there are 11 types of nodes in the DOM tree:
<ol class="org-ol">
<li>Document Node</li>
<li>Element Node</li>
<li>Attribute Node</li>
<li>Text Node</li>
<li>CDATA Section Node</li>
<li>Entity Reference Node</li>
<li>Entity Node</li>
<li>Processing Instruction Node</li>
<li>Comment Node</li>
<li>Document Type Node</li>
<li>Document Fragment Node</li>
</ol></li>
<li>There are some things to note however</li>
<li>Typically the leaf nodes include text nodes, comment nodes, and CDATA section nodes</li>
<li>Attribute nodes are <b>not</b> considered leaf nodes because attribute nodes are <b>not</b> considered to be part of the main DOM tree hierarchy like element or text nodes</li>
<li>Instead attribute nodes are "associated" with element nodes and held separately as part of the element's "NamedNodeMap"</li>
<li>The DOM tree represents parent-child relationships and attribute nodes are properties of elements, thus attributes are not children of the elements but properties (attributes) that exist on the element node</li>
<li>This is why attributes will not appear in the <code>childNodes</code> of an element and you can access the attributes using the element's property called <code>attributes</code></li>
<li>Another thing to note is that spaces and newlines are valid characters and become part of the DOM tree</li>
<li>Any character including whitespace, newlines, tabs, etc. that are inside an element will be part of the DOM tree as text objects under the element node as shown in the example above</li>
<li>There are only two exceptions and that is whitespace characters before the element <code>&lt;head&gt;</code> are ignored and white space after the closing body tag (<code>&lt;/body&gt;</code>) are automatically moved inside the body</li>
<li>Other than those exceptions every whitespace characters are placed into the DOM tree as text objects</li>

<li>Going back to the main nodes, the document node is the starting point for all visits to the DOM tree so when you access any element, attribute or text node you navigate to that node via the <code>document</code> node</li>
<li>HTML elements describe the structure of an HTML page so to access the DOM tree you start by looking for elements (via the document node) and once you find the element you want then you can access its text and attribute nodes</li>
<li>Thus you go from document node then you use some methods to find the element nodes and then you use methods / properties to find the text and attributes of the element you want to modify</li>
<li>HTML elements can carry attributes and these are represented by the attribute nodes in the DOM tree</li>
<li>Attribute nodes are <b>not</b> children of the element that carries them instead they <b>are part</b> of that element</li>
<li>Once you access an element there are specific JavaScript methods and properties to read or change that element's attributes</li>
<li>Once you have accessed an element node, you can can then reach the text within that element and this is stored in its own text node</li>
<li>Text nodes cannot have children and thus text nodes are leaf nodes</li>
<li>So if an element contains a text node <b>and</b> another child element, the other child element is <b>not</b> a child of the text node but rather a sibling of the text node and a child of the containing element</li>
<li>Thus relationships between the <code>document</code> and all of the element nodes are described using the same terms as a family tree: parents, children, siblings, ancestors, and descendents (so every node is technically a descendant of the <code>document</code> node)</li>
<li>Finally, each node is an object with methods and properties so scripts can access and update the DOM tree (not the source HTML file) but the DOM tree structure and any changes made to the DOM tree are reflected in the browser</li>
</ul>
</div>
</div>

<div id="outline-container-org75997c4" class="outline-3">
<h3 id="org75997c4">Section 5.3: Working with the DOM Tree</h3>
<div class="outline-text-3" id="text-org75997c4">
<ul class="org-ul">
<li>Accessing and updating the DOM tree involves two steps:
<ol class="org-ol">
<li>Locate the node that represents the element you want to work with</li>
<li>Use its text content, child elements, and attributes</li>
</ol></li>
</ul>
</div>
