Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.org
*** Section 5.3.1: Locating / Retrieving the Elements
    - There two common ways to locate or retrieve an element using DOM: DOM queries or traversing the DOM
    - Methods that find elements in the DOM tree are called DOM queries
    - For example, to select an individual element node, the most common methods are:
      - ~getElementByID(<id>)~: uses the value of an element's ~id~ attribute
      - ~querySelector(<selectors>)~: uses a CSS selector or group of CSS selectors and returns the first matching element
    - Common methods to select multiple elements are:
      - ~getElementsByClassName(<names>)~: selects all elements that have all of the given class names
      - ~getElementsByTagName(<names>)~: selects all elements that have the specified tag name
      - ~querySelectorAll(<selectors>)~: uses a CSS selector or group of CSS selectors to select all matching elements
    - These methods are commonly referred to as DOM queries because you query DOM to retrieve elements
    - Another way to retrieve elements is by traversing the DOM
    - Since the DOM is represented by a tree it can be traversed through the parents, children, and siblings
    - To traverse the DOM tree you need to have access to at least one element
    - For example, we all have access to the ~document~ element so we can use the property ~document.firstChild~ or ~document.lastChild~ to traverse the tree and get another element
    - You can then use continue to traverse until you receive a null value for example ~document.lastChild.lastChild.lastChild~ will return a valid element if it exists
    - So every element has the following properties which reference other elements and they are:
      - ~<elem>.parentNode~: selects the parent of the current element node (will return just one element)
      - ~<elem>.previousSibling~ or ~<elem>.nextSibling~: selects the previous or next sibling from the DOM tree
      - ~<elem>.firstChild~ or ~<elem>.lastChild~: Select the first or last child of current element
    - All of these elements can be stored in a variable so whenever you use a property or a method (DOM query), you can use a variable to store the element and use the element later via the variable created
    - Once you have the element in a variable you can work with that node, its parent, or any children without needing to find or retrieve that element again
    - The way the variable store the element is by storing a reference to the location of the element in the DOM tree so it can easily access the element without needing to find it again
    - Storing an element in a variable is called caching the selection because instead of having the browser find the element it will use the variable as a form of "cache"
    - Finding the quickest way to access an element within your web page will make the page seem faster and / or more responsive thus evaluating the minimum number of nodes on the way to the element you want to work with is best for a faster and more responsive web page
    - Usually ~getElementById()~ may be the fastest way to get to a single element since no two elements on the same page shuld have the same value for an ~id~ attribute but not all elements have the ~id~ attribute so we have to use what we can to get the fastest or shortest route to our element of interest
      
**** Section 5.3.1.1: Selecting Individual Elements
     - DOM queries may return one element, or they may return a ~NodeList~ which is a collection of nodes
     - Sometimes we would like to select one element or a group of elements (e.g. all ~<h1>~ elements)
     - Methods that return a single element node:

     | Method                          | Description                                                                                                                         |
     |---------------------------------+-------------------------------------------------------------------------------------------------------------------------------------|
     | ~getElementById('id')~          | Selects an individual element given the value of its ~id~ attribute                                                                 |
     | ~querySelector('css selector')~ | Uses CSS selector syntax that would select one or more elements but this method will only return the first of the matching elements |

     - ~getElementById()~ and ~querySelector()~ can both search an entire document and return individual elements (both use a similar syntax)
     - ~getElementById()~ is the quickest and most efficient way to access an element because no two elements can share the same value for their ~id~ attribute
     - ~getElementById()~ allows you to select a single element node by specifying the value of its ~id~ attribute
     - ~getElementById()~ has one parameter: the value of the ~id~ attribute on the element you want to select which is placed inside quotation marks because it is a string
     - ~querySelector()~ is a more flexible because its parameter is a CSS selector which means it can be used to accurately target many more elements but returns the first node of the matching elements

