Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.html

<div id="outline-container-orga251a44" class="outline-4">
<h4 id="orga251a44">Section 5.3.1: Locating / Retrieving the Elements</h4>
<div class="outline-text-4" id="text-orga251a44">
<ul class="org-ul">
<li>There two common ways to locate or retrieve an element using DOM: DOM queries or traversing the DOM</li>
<li>Methods that find elements in the DOM tree are called DOM queries</li>
<li>For example, to select an individual element node, the most common methods are:
<ul class="org-ul">
<li><code>getElementByID(&lt;id&gt;)</code>: uses the value of an element's <code>id</code> attribute</li>
<li><code>querySelector(&lt;selectors&gt;)</code>: uses a CSS selector or group of CSS selectors and returns the first matching element</li>
</ul></li>
<li>Common methods to select multiple elements are:
<ul class="org-ul">
<li><code>getElementsByClassName(&lt;names&gt;)</code>: selects all elements that have all of the given class names</li>
<li><code>getElementsByTagName(&lt;names&gt;)</code>: selects all elements that have the specified tag name</li>
<li><code>querySelectorAll(&lt;selectors&gt;)</code>: uses a CSS selector or group of CSS selectors to select all matching elements</li>
</ul></li>
<li>These methods are commonly referred to as DOM queries because you query DOM to retrieve elements</li>
<li>Another way to retrieve elements is by traversing the DOM</li>
<li>Since the DOM is represented by a tree it can be traversed through the parents, children, and siblings</li>
<li>To traverse the DOM tree you need to have access to at least one element</li>
<li>For example, we all have access to the <code>document</code> element so we can use the property <code>document.firstChild</code> or <code>document.lastChild</code> to traverse the tree and get another element</li>
<li>You can then use continue to traverse until you receive a null value for example <code>document.lastChild.lastChild.lastChild</code> will return a valid element if it exists</li>
<li>So every element has the following properties which reference other elements and they are:
<ul class="org-ul">
<li><code>&lt;elem&gt;.parentNode</code>: selects the parent of the current element node (will return just one element)</li>
<li><code>&lt;elem&gt;.previousSibling</code> or <code>&lt;elem&gt;.nextSibling</code>: selects the previous or next sibling from the DOM tree</li>
<li><code>&lt;elem&gt;.firstChild</code> or <code>&lt;elem&gt;.lastChild</code>: Select the first or last child of current element</li>
</ul></li>
<li>All of these elements can be stored in a variable so whenever you use a property or a method (DOM query), you can use a variable to store the element and use the element later via the variable created</li>
<li>Once you have the element in a variable you can work with that node, its parent, or any children without needing to find or retrieve that element again</li>
<li>The way the variable store the element is by storing a reference to the location of the element in the DOM tree so it can easily access the element without needing to find it again</li>
<li>Storing an element in a variable is called caching the selection because instead of having the browser find the element it will use the variable as a form of "cache"</li>
<li>Finding the quickest way to access an element within your web page will make the page seem faster and / or more responsive thus evaluating the minimum number of nodes on the way to the element you want to work with is best for a faster and more responsive web page</li>
<li>Usually <code>getElementById()</code> may be the fastest way to get to a single element since no two elements on the same page shuld have the same value for an <code>id</code> attribute but not all elements have the <code>id</code> attribute so we have to use what we can to get the fastest or shortest route to our element of interest</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="orgfccaf0a"></a>Section 5.3.1.1: Selecting Individual Elements<br />
<div class="outline-text-5" id="text-orgfccaf0a">
<ul class="org-ul">
<li>DOM queries may return one element, or they may return a <code>NodeList</code> which is a collection of nodes</li>
<li>Sometimes we would like to select one element or a group of elements (e.g. all <code>&lt;h1&gt;</code> elements)</li>
<li>Methods that return a single element node:</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Method</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>getElementById('id')</code></td>
<td class="org-left">Selects an individual element given the value of its <code>id</code> attribute</td>
</tr>

<tr>
<td class="org-left"><code>querySelector('css selector')</code></td>
<td class="org-left">Uses CSS selector syntax that would select one or more elements but this method will only return the first of the matching elements</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li><code>getElementById()</code> and <code>querySelector()</code> can both search an entire document and return individual elements (both use a similar syntax)</li>
<li><code>getElementById()</code> is the quickest and most efficient way to access an element because no two elements can share the same value for their <code>id</code> attribute</li>
<li><code>getElementById()</code> allows you to select a single element node by specifying the value of its <code>id</code> attribute</li>
<li><code>getElementById()</code> has one parameter: the value of the <code>id</code> attribute on the element you want to select which is placed inside quotation marks because it is a string</li>
<li><code>querySelector()</code> is a more flexible because its parameter is a CSS selector which means it can be used to accurately target many more elements but returns the first node of the matching elements</li>
</ul>
</div>
</li>
