Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.org
**** Section 5.3.1.2: Selecting Multiple Elements
     - If a method /can/ return more than one node then it will always return a ~NodeList~ which is a collection of nodes (even if it only finds one matching element)
     - You then can either iterate through the list or select the element you want from the list using an index number (recall the index number always start at zero)
     - Methods that return one or more elements as a ~NodeList~

     | Method                             | Description                                                                                                            |
     |------------------------------------+------------------------------------------------------------------------------------------------------------------------|
     | ~getElementsByClassName('class')~  | Selects one or more elements given the value of their class attribute (this method is faster than ~querySelectorAll()~ |
     | ~getElementsByTagName('tagName')~  | Selects all elements on the page with the specified tag name (this method is faster than ~querySelectorAll()~          |
     | ~querySelectorAll('css selector')~ | Uses CSS selector syntax to select one or more elements and returns all of those that match                            |

     - A ~NodeList~ is a collection of element nodes and each node has an index number (starting at zero)
     - The order in which the element nodes are stored in a ~NodeList~ is the same order that they appear in the HTML page
     - When a DOM query returns a ~NodeList~ you may want to select one element from the list or loop through each item in the list and perform some statements on the elements
     - Although ~NodeList~ may have similar characteristics like an array, it is *not* an actual array, instead they are a type of object called a collection
     - ~NodeList~ has properties and methods such as ~.length~ (specifies the amount of items in the list) and ~.item()~ which returns a specific node from the list when you tell it the index number of item that you want
     - You can also use square brackets with the list to retrieve an item just like an array
     - You can store the object reference to the ~NodeList~ in a variable to work with the same selection of elements several times rather than collecting the same elements again
     - There are type "types" of ~NodeList~ you can use, either "live" ~NodeList~ or "static" ~NodeList~
     - Live ~NodeList~ are lists that are automatically updated when the DOM changes, for example, let's say we get all the items with the class "item" and later the DOM changes because we changed a node to have the class "item" the list will be automatically updated to reflect the DOM changes so it will include the new item we just added
     - So live ~NodeList~ reflect the changes of DOM if items have been added or removed from the list without needing to do any work because it happens automatically
     - The methods beginning with ~getElementsBy...~ return live ~NodeList~ and are typically faster to generate than static ~NodeList~
     - Static ~NodeList~ does not update the list automatically when the DOM changes thus whenever a new item is added or removed that is under your search criteria, you will have to re-query the DOM tree to get an updated list
     - If you do not re-query then the static ~NodeList~ will have the old unchanged list, it will not update or change to reflect the changes of DOM
     - The methods that begin ~querySelector...~ which use CSS selector syntax return static ~NodeList~ as they reflect the document when the query was made

***** Section 5.3.1.2.1: Selecting Elements Using Class Attributes
      - ~getElementsByClassName()~ method allows you to select elements whose class attribute contains a specific value
      - The method has one parameter: the class name which is given in quotes within the parentheses after the method name
      - This method always returns a ~NodeList~
      - The value of a class attribute can contain several class names each separated by a space but the method will try to find the class specified in the method within those class names separated by space
      - For example, let's say we have a class attribute with the value "style1 style2 style3" then if you were to specify to the method ~getElementsByClassName()~ "style1" then it will still retrieve it, "style2" will retrieve it as well, "style1 style2" will retrieve it as well, and even "style1 style3" will retrieve it as well
      - Why does the example above work? Take for example the argument "style1 style3" it is checking for elements that contain the class name "style1" and the elements that contain "style3" the order does not matter and each class name separated by a space are treated separate and individual class names just because an element has multiple class names does not mean that is their class names instead they have multiple class names
      - In other words, each class name are separated and individual class names which an element may be part of multiple class names and when you specify an argument in the method ~getElementsByClassName~ you are also treating the space separated class names as individual class names
	
***** Section 5.3.1.2.2: Selecting Elements By Tag Name
      - The ~getElementsByTagName()~ method allows you to select elements using their tag name
      - The element name is spceified as a parameter so it is placed inside the parentheses and is contained by quotation marks
      - Note that you do not include the angled brackets that surround the tag name in the HTML just the letters inside the brackets

***** Section 5.3.1.2.3: Selecting Elements Using CSS Selectors
      - ~querySelector()~ returns the first element node that matches the CSS-style selector
      - ~querySelectorAll()~ returns a ~NodeList~ of all of the elements that matches the CSS-style selector
      - Both methods take a CSS selector as their only parameter and the CSS selector syntax offers more flexibility and accuracy when selecting an element than just specifying a calss name or a tag name
      - JS code runs one line at a time and statements affect the content of a page as the interpreter processes them
      - So if a DOM query runs when a page loads and there are some statements that can affect the elements then rerunning the same query could return different set of elements because the elements were changed / modified

