Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.html

<li><a id="org0cf5630"></a>Section 5.3.1.2: Selecting Multiple Elements<br />
<div class="outline-text-5" id="text-org0cf5630">
<ul class="org-ul">
<li>If a method <i>can</i> return more than one node then it will always return a <code>NodeList</code> which is a collection of nodes (even if it only finds one matching element)</li>
<li>You then can either iterate through the list or select the element you want from the list using an index number (recall the index number always start at zero)</li>
<li>Methods that return one or more elements as a <code>NodeList</code></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Method</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>getElementsByClassName('class')</code></td>
<td class="org-left">Selects one or more elements given the value of their class attribute (this method is faster than <code>querySelectorAll()</code></td>
</tr>

<tr>
<td class="org-left"><code>getElementsByTagName('tagName')</code></td>
<td class="org-left">Selects all elements on the page with the specified tag name (this method is faster than <code>querySelectorAll()</code></td>
</tr>

<tr>
<td class="org-left"><code>querySelectorAll('css selector')</code></td>
<td class="org-left">Uses CSS selector syntax to select one or more elements and returns all of those that match</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>A <code>NodeList</code> is a collection of element nodes and each node has an index number (starting at zero)</li>
<li>The order in which the element nodes are stored in a <code>NodeList</code> is the same order that they appear in the HTML page</li>
<li>When a DOM query returns a <code>NodeList</code> you may want to select one element from the list or loop through each item in the list and perform some statements on the elements</li>
<li>Although <code>NodeList</code> may have similar characteristics like an array, it is <b>not</b> an actual array, instead they are a type of object called a collection</li>
<li><code>NodeList</code> has properties and methods such as <code>.length</code> (specifies the amount of items in the list) and <code>.item()</code> which returns a specific node from the list when you tell it the index number of item that you want</li>
<li>You can also use square brackets with the list to retrieve an item just like an array</li>
<li>You can store the object reference to the <code>NodeList</code> in a variable to work with the same selection of elements several times rather than collecting the same elements again</li>
<li>There are type "types" of <code>NodeList</code> you can use, either "live" <code>NodeList</code> or "static" <code>NodeList</code></li>
<li>Live <code>NodeList</code> are lists that are automatically updated when the DOM changes, for example, let's say we get all the items with the class "item" and later the DOM changes because we changed a node to have the class "item" the list will be automatically updated to reflect the DOM changes so it will include the new item we just added</li>
<li>So live <code>NodeList</code> reflect the changes of DOM if items have been added or removed from the list without needing to do any work because it happens automatically</li>
<li>The methods beginning with <code>getElementsBy...</code> return live <code>NodeList</code> and are typically faster to generate than static <code>NodeList</code></li>
<li>Static <code>NodeList</code> does not update the list automatically when the DOM changes thus whenever a new item is added or removed that is under your search criteria, you will have to re-query the DOM tree to get an updated list</li>
<li>If you do not re-query then the static <code>NodeList</code> will have the old unchanged list, it will not update or change to reflect the changes of DOM</li>
<li>The methods that begin <code>querySelector...</code> which use CSS selector syntax return static <code>NodeList</code> as they reflect the document when the query was made</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org70862ab"></a>Section 5.3.1.2.1: Selecting Elements Using Class Attributes<br />
<div class="outline-text-6" id="text-org70862ab">
<ul class="org-ul">
<li><code>getElementsByClassName()</code> method allows you to select elements whose class attribute contains a specific value</li>
<li>The method has one parameter: the class name which is given in quotes within the parentheses after the method name</li>
<li>This method always returns a <code>NodeList</code></li>
<li>The value of a class attribute can contain several class names each separated by a space but the method will try to find the class specified in the method within those class names separated by space</li>
<li>For example, let's say we have a class attribute with the value "style1 style2 style3" then if you were to specify to the method <code>getElementsByClassName()</code> "style1" then it will still retrieve it, "style2" will retrieve it as well, "style1 style2" will retrieve it as well, and even "style1 style3" will retrieve it as well</li>
<li>Why does the example above work? Take for example the argument "style1 style3" it is checking for elements that contain the class name "style1" and the elements that contain "style3" the order does not matter and each class name separated by a space are treated separate and individual class names just because an element has multiple class names does not mean that is their class names instead they have multiple class names</li>
<li>In other words, each class name are separated and individual class names which an element may be part of multiple class names and when you specify an argument in the method <code>getElementsByClassName</code> you are also treating the space separated class names as individual class names</li>
</ul>
</div>
</li>

<li><a id="org1672ce2"></a>Section 5.3.1.2.2: Selecting Elements By Tag Name<br />
<div class="outline-text-6" id="text-org1672ce2">
<ul class="org-ul">
<li>The <code>getElementsByTagName()</code> method allows you to select elements using their tag name</li>
<li>The element name is spceified as a parameter so it is placed inside the parentheses and is contained by quotation marks</li>
<li>Note that you do not include the angled brackets that surround the tag name in the HTML just the letters inside the brackets</li>
</ul>
</div>
</li>

<li><a id="orgd10220a"></a>Section 5.3.1.2.3: Selecting Elements Using CSS Selectors<br />
<div class="outline-text-6" id="text-orgd10220a">
<ul class="org-ul">
<li><code>querySelector()</code> returns the first element node that matches the CSS-style selector</li>
<li><code>querySelectorAll()</code> returns a <code>NodeList</code> of all of the elements that matches the CSS-style selector</li>
<li>Both methods take a CSS selector as their only parameter and the CSS selector syntax offers more flexibility and accuracy when selecting an element than just specifying a calss name or a tag name</li>
<li>JS code runs one line at a time and statements affect the content of a page as the interpreter processes them</li>
<li>So if a DOM query runs when a page loads and there are some statements that can affect the elements then rerunning the same query could return different set of elements because the elements were changed / modified</li>
</ul>
</div>
</li>
