Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.org
***** Section 5.3.1.2.3: Using the ~NodeList~
      - To select an element from a ~NodeList~ you can item use the ~item()~ method or the array syntax: both require the index number of the element you want
      - The ~item()~ method returns an individual node from the ~NodeList~ by specifying the index number of the element you want as a parameter of the method
      - You can use the ~length~ property of the ~NodeList~ to tell you how many items are in the ~NodeList~
      - Array syntax is preferred over the ~item()~ method because it is faster
      - You can access individual nodes using a square bracket syntax similar to that used to access individual items from an array by specifying the index number of the element you want inside the square brackets
      - Store the ~NodeList~ in a variable if you repeatedly use the ~NodeList~
      - When you have a ~NodeList~ you can loop through each node in the collection and apply the same statements to each
      - You can loops (for-loops are more adequate for ~NodeList~) to iterate through the loops and apply some statements to each item

**** Section 5.3.1.3: Traversing the DOM
     - When you have an element node you can select another element in relation to it using these five properties (this is known as traversing the DOM):
       - ~parentNode~: Finds the element node for the containing or parent element of the current node (e.g. you have a ~<li>~ node then the parent node could be ~<ol>~ or ~<ul>~)
       - ~previousSibling~ / ~nextSibling~: Finds the previous or next siblings element nodes of the current node (e.g. you have a ~<li>~ then the siblings nodes could be other ~<li>~ that came before or after the current ~<li>~ node)
       - ~firstChild~ / ~lastChild~: Find the first or last child node of the currrent node (e.g. you have a ~<ul>~ then the children nodes, first or last, could be ~<li>~ nodes)
     - These are properties of the current node not methods to select an element therfore they do not end in parentheses
     - If you use these properties and they do not have a previous sibling, next sibling, first child, or last child then the result will be ~null~
     - These properties are *read-only* they can only be used to select a new node but you *cannot* update the parent, sibling, or child (you will need to use other methods to change the DOM tree)
     - Traversing the DOM can be difficult because some browsers add a text node whenever they come across whitespace between elements
     - Whitespace between elements are treated as text nodes so the properties (~previousSibling~, ~nextSibling~, ~firstChild~, and ~lastChild~) can return different elements depending on the browser and how it treats whitespace
     - Thus text nodes are created for whitespace characters and added to the DOM tree
     - You could take out all the whitespace from your HTML page and it will technically be smaller and faster (because no text nodes) but it will make the code much harder to read
     - Another solution is to avoid using the properties ~previousSibling~, ~nextSibling~, ~firstChild~, and ~lastChild~ to avoid any possible unexpected behavior and instead use a JS library such as jQuery which helps deal with such problems
     - Some browsers may or may not create text nodes for whitespaces so it all depends on the browsers' implementation thus the properties may be pointing you may not expect and thus it is best to avoid using these properties
     - However, almost all modern browsers create text nodes for whitespaces
     - The only time it is safe to use these properties (~previousSibling~, ~nextSibling~, ~firstChild~, and ~lastChild~) is if there are no whitespace or if you know your web page will only be run in browsers that treat whitespace as text nodes
       
