Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.html

<li><a id="orgc830949"></a>Section 5.3.1.2.3: Using the <code>NodeList</code><br />
<div class="outline-text-6" id="text-orgc830949">
<ul class="org-ul">
<li>To select an element from a <code>NodeList</code> you can item use the <code>item()</code> method or the array syntax: both require the index number of the element you want</li>
<li>The <code>item()</code> method returns an individual node from the <code>NodeList</code> by specifying the index number of the element you want as a parameter of the method</li>
<li>You can use the <code>length</code> property of the <code>NodeList</code> to tell you how many items are in the <code>NodeList</code></li>
<li>Array syntax is preferred over the <code>item()</code> method because it is faster</li>
<li>You can access individual nodes using a square bracket syntax similar to that used to access individual items from an array by specifying the index number of the element you want inside the square brackets</li>
<li>Store the <code>NodeList</code> in a variable if you repeatedly use the <code>NodeList</code></li>
<li>When you have a <code>NodeList</code> you can loop through each node in the collection and apply the same statements to each</li>
<li>You can loops (for-loops are more adequate for <code>NodeList</code>) to iterate through the loops and apply some statements to each item</li>
</ul>
</div>
</li>
</ul>
</li>

<li><a id="org66067b6"></a>Section 5.3.1.3: Traversing the DOM<br />
<div class="outline-text-5" id="text-org66067b6">
<ul class="org-ul">
<li>When you have an element node you can select another element in relation to it using these five properties (this is known as traversing the DOM):
<ul class="org-ul">
<li><code>parentNode</code>: Finds the element node for the containing or parent element of the current node (e.g. you have a <code>&lt;li&gt;</code> node then the parent node could be <code>&lt;ol&gt;</code> or <code>&lt;ul&gt;</code>)</li>
<li><code>previousSibling</code> / <code>nextSibling</code>: Finds the previous or next siblings element nodes of the current node (e.g. you have a <code>&lt;li&gt;</code> then the siblings nodes could be other <code>&lt;li&gt;</code> that came before or after the current <code>&lt;li&gt;</code> node)</li>
<li><code>firstChild</code> / <code>lastChild</code>: Find the first or last child node of the currrent node (e.g. you have a <code>&lt;ul&gt;</code> then the children nodes, first or last, could be <code>&lt;li&gt;</code> nodes)</li>
</ul></li>
<li>These are properties of the current node not methods to select an element therfore they do not end in parentheses</li>
<li>If you use these properties and they do not have a previous sibling, next sibling, first child, or last child then the result will be <code>null</code></li>
<li>These properties are <b>read-only</b> they can only be used to select a new node but you <b>cannot</b> update the parent, sibling, or child (you will need to use other methods to change the DOM tree)</li>
<li>Traversing the DOM can be difficult because some browsers add a text node whenever they come across whitespace between elements</li>
<li>Whitespace between elements are treated as text nodes so the properties (<code>previousSibling</code>, <code>nextSibling</code>, <code>firstChild</code>, and <code>lastChild</code>) can return different elements depending on the browser and how it treats whitespace</li>
<li>Thus text nodes are created for whitespace characters and added to the DOM tree</li>
<li>You could take out all the whitespace from your HTML page and it will technically be smaller and faster (because no text nodes) but it will make the code much harder to read</li>
<li>Another solution is to avoid using the properties <code>previousSibling</code>, <code>nextSibling</code>, <code>firstChild</code>, and <code>lastChild</code> to avoid any possible unexpected behavior and instead use a JS library such as jQuery which helps deal with such problems</li>
<li>Some browsers may or may not create text nodes for whitespaces so it all depends on the browsers' implementation thus the properties may be pointing you may not expect and thus it is best to avoid using these properties</li>
<li>However, almost all modern browsers create text nodes for whitespaces</li>
<li>The only time it is safe to use these properties (<code>previousSibling</code>, <code>nextSibling</code>, <code>firstChild</code>, and <code>lastChild</code>) is if there are no whitespace or if you know your web page will only be run in browsers that treat whitespace as text nodes</li>
</ul>
</div>
</li>
</ul>
</div>
