Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.org
*** Section 5.3.2: Use / Update the Elements
    - Text inside any element is stored inside a text node
    - Recall that if text exist within an element, the element will have one or multiple text nodes as children in the DOM tree
    - How can you access the text nodes?
    - There isn't a method or property that retrieves the text nodes or the child text nodes instead you use the properties that traverse the DOM tree such as ~.firstChild~ or ~.lastChild~ or you can use the property ~.childNodes~ which returns a ~NodeList~ which is a list with all the child nodes
    - Then you can determine the type of node by using ~.nodeType~ and filter based on the text node
    - An element may have multiple text nodes
    - So to access the text node, you first retrieve an element (other than the text node) and you use one of their properties to retrieve their child text node (using ~.firstChild~, ~.lastChild~, or ~.childNodes~)
    - Recall that the text nodes are leaf nodes and do not have any children
    - Once you have access to the text node, then you can use the text node's *only* property ~.nodeValue~ to get the text from the element
    - The property ~.nodeValue~ is only useful and meaningful to a few nodes such as text nodes (stores text content), comment nodes (stores comment text), attribute nodes (stores attribute values), and CDATA section nodes (stores CDATA content)
    - The property ~.nodeValue~ for the other nodes is null
    - You can use the property ~.nodeValue~ to update, use, or change the text contents of the text node within the parent element, for example, if the text content says "hello" you can change it by overriding the content to "bye"
    - Thus the ~.nodeValue~ lets you access or update contents of a text node and recall that if the parent element has other child elements then there may be multiple text nodes that were separated due to the child elements and the text nodes only represent a portion of the full text and the text node will *not* have the text of the other child elements (or sibling elements to the text nodes)
    - For example, let's say we have the following HTML:

    #+BEGIN_SRC html
      <div id="example">
	Hello
	<span>World</span>
      </div>	
    #+END_SRC

    - This creates the following DOM tree (starting with the div to just demonstrate the example)

    #+BEGIN_SRC text
      div
      |- text: "\nHello\n"
	 |- span
	    |- text: "World"
      |- text: "\n"
    #+END_SRC

    - Notice how the text is split because there is a child element in-between
    - Notice how there are multiple text nodes
    - Finally notice the contents within each text node, the first text node only contains "\nHello" and nothing else, this is what is meant by text nodes do not include any text from other child elements (or sibling elements from the text node) because new text nodes are created for those child elements such as the element span in the example

    - There are also other properties to access the contents of the element and those properties are ~.innerHTML~ and ~.textContent~
    - ~.innerHTML~ returns HTML markup as a string so for example ~document.getElementById("example").innerHTML~ will return "Hello\n<span>World</span>" notice how the HTML tags are included
    - If you were to modify ~.innerHTML~ then you may include HTML tags and it will be rendered by the browser onto the web page
    - ~.textContent~ only returns the text inside the element with no tags so for example ~document.getElementById("example").textContent~ will return "Hello World" without any HTML tags
    - If you were to replace ~.textContent~ you will replace all the text with your update string and if you were to include HTML tags then it will *not* render the tags and just treat it as plain text
    - ~.innerHTML~ may be dangerous since you can enter HTML and thus include scripts while ~.textContent~ only inserts plain scripts and is safe from HTML injection
    - So ~.innerHTML~ gets the all the content and HTML tags within an element and you can update the HTML because the browser will render HTML tags
    - ~.textContent~ gets all the plain text inside an element and you can update the plain text with a string and the string will be treated as plain text
    - When an element contains a mix of text and other elements, you are more likely to work with the containing element rather than the idividualnodes for each descendant
      
    - There are other ways to update elements and the DOM tree using methods such as:
      - ~document.createElement()~: creates HTML element
      - ~document.createTextNode()~: creates a text node
    - However just by creating a new HTML element node or a text node does not automatically add them to an existing element or the DOM tree
    - To add an HTML element to the DOM tree you use ~elem.appendChild(<newNode>)~ to add it to an element that is already in the DOM tree
    - If you add the new node to another node that is already in the DOM tree then your new node is added to the DOM tree
    - The same goes for text nodes, text nodes are needed to be added to an element, this element can be already in the DOM tree or be added later
    - You can also insert the text node using ~appendChild()~, ~insertBefore()~, or any other valid method
    - You may also remove elements using ~removeChild(<node>)~
    - Creating, inserting and removing nodes in the DOM is called DOM manipulation

    - Finally, you can access or update attribute values such as the attributes "class" and "id"
    - To get the classes and id of an element you simply use the attributes ~<elem>.className~ or ~<elem>.id~ and you can override such attributes
    - However, there are methods to manipulate attributes, for example ~hasAttribute()~ checks if an attribute exists, ~getAttribute()~ gets the value of the attribute, ~setAttribute()~ updates the value of the attribute, and ~removeAttribute()~ removes an attribute
    
    - To work with the content of elements you can: navigate to the text nodes (works best when elements only contains text no other elements) or when can work with the containing element because this allows you to access its text nodes and child elements (works best if the element has text nodes and child elements that are siblings)
    - Once you have navigated from an element to its text node, there is one property that you will use and that is ~nodeValue~ which accesses text from the node
    - When you are working with an element node (rather than its text node) that element can contain markup so you have to choose whether you want to retrieve (get) or update (set) the markup as well as the text
    - For example, ~innerHTML~ gets / sets the text & HTML markup while ~textContent~ and ~innerText~ gets and sets text only
    - When you use these properties to update the content of an element, the new content will overwrite the entire contents of the element both text and markup

