Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.html

<div id="outline-container-org0f4daf6" class="outline-4">
<h4 id="org0f4daf6">Section 5.3.2: Use / Update the Elements</h4>
<div class="outline-text-4" id="text-org0f4daf6">
<ul class="org-ul">
<li>Text inside any element is stored inside a text node</li>
<li>Recall that if text exist within an element, the element will have one or multiple text nodes as children in the DOM tree</li>
<li>How can you access the text nodes?</li>
<li>There isn't a method or property that retrieves the text nodes or the child text nodes instead you use the properties that traverse the DOM tree such as <code>.firstChild</code> or <code>.lastChild</code> or you can use the property <code>.childNodes</code> which returns a <code>NodeList</code> which is a list with all the child nodes</li>
<li>Then you can determine the type of node by using <code>.nodeType</code> and filter based on the text node</li>
<li>An element may have multiple text nodes</li>
<li>So to access the text node, you first retrieve an element (other than the text node) and you use one of their properties to retrieve their child text node (using <code>.firstChild</code>, <code>.lastChild</code>, or <code>.childNodes</code>)</li>
<li>Recall that the text nodes are leaf nodes and do not have any children</li>
<li>Once you have access to the text node, then you can use the text node's <b>only</b> property <code>.nodeValue</code> to get the text from the element</li>
<li>The property <code>.nodeValue</code> is only useful and meaningful to a few nodes such as text nodes (stores text content), comment nodes (stores comment text), attribute nodes (stores attribute values), and CDATA section nodes (stores CDATA content)</li>
<li>The property <code>.nodeValue</code> for the other nodes is null</li>
<li>You can use the property <code>.nodeValue</code> to update, use, or change the text contents of the text node within the parent element, for example, if the text content says "hello" you can change it by overriding the content to "bye"</li>
<li>Thus the <code>.nodeValue</code> lets you access or update contents of a text node and recall that if the parent element has other child elements then there may be multiple text nodes that were separated due to the child elements and the text nodes only represent a portion of the full text and the text node will <b>not</b> have the text of the other child elements (or sibling elements to the text nodes)</li>
<li>For example, let's say we have the following HTML:</li>
</ul>

<div class="org-src-container">
<pre class="src src-html">&lt;div id="example"&gt;
  Hello
  &lt;span&gt;World&lt;/span&gt;
&lt;/div&gt;	
</pre>
</div>

<ul class="org-ul">
<li>This creates the following DOM tree (starting with the div to just demonstrate the example)</li>
</ul>

<div class="org-src-container">
<pre class="src src-text">div
|- text: "\nHello\n"
   |- span
      |- text: "World"
|- text: "\n"
</pre>
</div>

<ul class="org-ul">
<li>Notice how the text is split because there is a child element in-between</li>
<li>Notice how there are multiple text nodes</li>
<li>Finally notice the contents within each text node, the first text node only contains "\nHello" and nothing else, this is what is meant by text nodes do not include any text from other child elements (or sibling elements from the text node) because new text nodes are created for those child elements such as the element span in the example</li>

<li>There are also other properties to access the contents of the element and those properties are <code>.innerHTML</code> and <code>.textContent</code></li>
<li><code>.innerHTML</code> returns HTML markup as a string so for example <code>document.getElementById("example").innerHTML</code> will return "Hello\n&lt;span&gt;World&lt;/span&gt;" notice how the HTML tags are included</li>
<li>If you were to modify <code>.innerHTML</code> then you may include HTML tags and it will be rendered by the browser onto the web page</li>
<li><code>.textContent</code> only returns the text inside the element with no tags so for example <code>document.getElementById("example").textContent</code> will return "Hello World" without any HTML tags</li>
<li>If you were to replace <code>.textContent</code> you will replace all the text with your update string and if you were to include HTML tags then it will <b>not</b> render the tags and just treat it as plain text</li>
<li><code>.innerHTML</code> may be dangerous since you can enter HTML and thus include scripts while <code>.textContent</code> only inserts plain scripts and is safe from HTML injection</li>
<li>So <code>.innerHTML</code> gets the all the content and HTML tags within an element and you can update the HTML because the browser will render HTML tags</li>
<li><code>.textContent</code> gets all the plain text inside an element and you can update the plain text with a string and the string will be treated as plain text</li>
<li>When an element contains a mix of text and other elements, you are more likely to work with the containing element rather than the idividualnodes for each descendant</li>

<li>There are other ways to update elements and the DOM tree using methods such as:
<ul class="org-ul">
<li><code>document.createElement()</code>: creates HTML element</li>
<li><code>document.createTextNode()</code>: creates a text node</li>
</ul></li>
<li>However just by creating a new HTML element node or a text node does not automatically add them to an existing element or the DOM tree</li>
<li>To add an HTML element to the DOM tree you use <code>elem.appendChild(&lt;newNode&gt;)</code> to add it to an element that is already in the DOM tree</li>
<li>If you add the new node to another node that is already in the DOM tree then your new node is added to the DOM tree</li>
<li>The same goes for text nodes, text nodes are needed to be added to an element, this element can be already in the DOM tree or be added later</li>
<li>You can also insert the text node using <code>appendChild()</code>, <code>insertBefore()</code>, or any other valid method</li>
<li>You may also remove elements using <code>removeChild(&lt;node&gt;)</code></li>
<li>Creating, inserting and removing nodes in the DOM is called DOM manipulation</li>

<li>Finally, you can access or update attribute values such as the attributes "class" and "id"</li>
<li>To get the classes and id of an element you simply use the attributes <code>&lt;elem&gt;.className</code> or <code>&lt;elem&gt;.id</code> and you can override such attributes</li>
<li>However, there are methods to manipulate attributes, for example <code>hasAttribute()</code> checks if an attribute exists, <code>getAttribute()</code> gets the value of the attribute, <code>setAttribute()</code> updates the value of the attribute, and <code>removeAttribute()</code> removes an attribute</li>

<li>To work with the content of elements you can: navigate to the text nodes (works best when elements only contains text no other elements) or when can work with the containing element because this allows you to access its text nodes and child elements (works best if the element has text nodes and child elements that are siblings)</li>
<li>Once you have navigated from an element to its text node, there is one property that you will use and that is <code>nodeValue</code> which accesses text from the node</li>
<li>When you are working with an element node (rather than its text node) that element can contain markup so you have to choose whether you want to retrieve (get) or update (set) the markup as well as the text</li>
<li>For example, <code>innerHTML</code> gets / sets the text &amp; HTML markup while <code>textContent</code> and <code>innerText</code> gets and sets text only</li>
<li>When you use these properties to update the content of an element, the new content will overwrite the entire contents of the element both text and markup</li>
</ul>
</div>

<ul class="org-ul">
