Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.org
**** Section 5.3.2.1: Accessing the Text Node
     - When you select a text node, you can retrieve or amend the content of it using the ~nodeValue~ property
     - In order to use the ~nodeValue~ you must be on a text node, not the element that contains the text
     - To work with text in an element, first the element node is accessed and then its text node
     - The text node has a property called ~nodeValue~ which returns the text in that next node
     - You can also use the ~nodeValue~ property to update the content of a text node

**** Section 5.3.2.2: Accessing Text (Not Text Node)
     - ~textContent~ property allows you to collect or update just the text that is in the containing element and its children
     - Why do I mean by that? Basically, ~textContent~ will retrieve all the text from all text nodes *including* from child elements
     - For example, let's say we have the following HTML:

     #+BEGIN_SRC html
       <p>Hello <span>World</span></p>
     #+END_SRC

     - This will produce a DOM tree as such:

     #+BEGIN_SRC text
       p
       |- text: "Hello "
       |- span
	  |- text: "World"
     #+END_SRC

     - So what ~textContent~ will do, it will try to find all text nodes that are children of the node or text nodes that are descendants of the node
     - In this case we have two text nodes and it will retrieve the text and return it so it will retrieve "Hello " + "World" = "Hello World"
     - So ~textContent~ will retrieve all text from all text nodes that are descendants even if the text node are not direct children of the containing node
     - You can also use this property to update the content of the element but it is replaces the entire content of it (including any markup)
     - *Assumption*: I'm assuming what it does when we update the content, it replaces all children involved (directly like the text nodes or indirectly like the parent of a descendant of a text node) with a single text node that holds the updated value
     - This is why updating the content of ~textContent~ will replace the entire content including any markup thus possibly changing your HTML web page (not just like the text)
     - There is also another property that is similar to ~textContent~ and that is ~innerText~
     - The difference is that ~innerText~ takes into account CSS rules and gets the text of how it actually appears on the screen
     - Thus if the CSS rule says to hide the element (e.g. ~display: none~) then it won't show it, if the CSS element says uppercase but the actual HTML is in lowercase then instead of showing it lowercase like in ~textContent~, it will show it in uppercase in ~innerText~, if there are new line characters then it will show it in ~innerText~
     - ~innerText~ will show the text just as how it appears by respecting the CSS rules
     - However, because it takes into account CSS rules it is slower than ~textContent~
     - You can also update ~innerText~ but will replace all child elements with a single text node with the value given just like ~textContent~

**** Section 5.3.2.3: Adding or Removing HTML Content
     - There are two very different approaches to adding and removing content from a DOM tree: ~innerHTML~ property and DOM manipulation
     - There are security risks associated with using ~innerHTML~ but ~innerHTML~ can be used on any element node
     - ~innerHTML~ can be used to retrieve and replace content
     - To update an element using ~innerHTML~ the new content is provided as a string and it can contain markup for descendant elements
     - So to add new content for ~innerHTML~ you store new content (including markup) as a string in variable, you select the element whose content you want to replace, and you set the element's ~innerHTML~ property to be the new string
     - To remove content from ~innerHTML~ you either provide an empty string or if you want to remove a single descendant and not remove the rest then you provide the entire markup in the new string but now *without* the element you want to remove
     - DOM manipulation easily targets individual nodes in the DOM tree whereas ~innerHTML~ is better suited to updating entire fragments within a node
     - DOM manipulation can be safer than using ~innerHTML~ but it requires more code and can be slower
     - DOM manipulation refers to a set of DOM methods that allow you to create elements and text nodes, and then attach them to the DOM tree or remove them from the DOM tree
     - To add content (via DOM manipulation) you use a DOM method to create a new node with some stype of content, one at a time, and store it in a variable then another DOM method is used to attach the node in the correct position in the DOM tree
     - You can also remove nodes along with its content and child nodes from the DOM tree using a DOM method

***** Section 5.3.2.3.1: Inner HTML
      - Using the ~innerHTML~ property you can access and amend the contents of an element including any child elements
      - When getting HTML from an element, the ~innerHTML~ property will get the content of an element and return it as one long string including markup that the element contains
      - When used to set new content for an element, it will take a string that /can/ contain markup and process that string adding any elements within it to the DOM tree
      - When adding new content using ~innerHTML~, be aware that one missing closing tag would throw out the design of the entire page
      - Even worse, if ~innerHTML~ is used to add content that your users created to a page, they could add malicious content
      - Any new elements will also be available to other scripts in the page
      - Quotation marks can be escaped whenever you need to use them such as in attributes for elements
	
