Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.html
<li><a id="orge803571"></a>Section 5.3.2.1: Accessing the Text Node<br />
<div class="outline-text-5" id="text-orge803571">
<ul class="org-ul">
<li>When you select a text node, you can retrieve or amend the content of it using the <code>nodeValue</code> property</li>
<li>In order to use the <code>nodeValue</code> you must be on a text node, not the element that contains the text</li>
<li>To work with text in an element, first the element node is accessed and then its text node</li>
<li>The text node has a property called <code>nodeValue</code> which returns the text in that next node</li>
<li>You can also use the <code>nodeValue</code> property to update the content of a text node</li>
</ul>
</div>
</li>

<li><a id="org3bfa5be"></a>Section 5.3.2.2: Accessing Text (Not Text Node)<br />
<div class="outline-text-5" id="text-org3bfa5be">
<ul class="org-ul">
<li><code>textContent</code> property allows you to collect or update just the text that is in the containing element and its children</li>
<li>Why do I mean by that? Basically, <code>textContent</code> will retrieve all the text from all text nodes <b>including</b> from child elements</li>
<li>For example, let's say we have the following HTML:</li>
</ul>

<div class="org-src-container">
<pre class="src src-html">&lt;p&gt;Hello &lt;span&gt;World&lt;/span&gt;&lt;/p&gt;
</pre>
</div>

<ul class="org-ul">
<li>This will produce a DOM tree as such:</li>
</ul>

<div class="org-src-container">
<pre class="src src-text">p
|- text: "Hello "
|- span
   |- text: "World"
</pre>
</div>

<ul class="org-ul">
<li>So what <code>textContent</code> will do, it will try to find all text nodes that are children of the node or text nodes that are descendants of the node</li>
<li>In this case we have two text nodes and it will retrieve the text and return it so it will retrieve "Hello " + "World" = "Hello World"</li>
<li>So <code>textContent</code> will retrieve all text from all text nodes that are descendants even if the text node are not direct children of the containing node</li>
<li>You can also use this property to update the content of the element but it is replaces the entire content of it (including any markup)</li>
<li><b>Assumption</b>: I'm assuming what it does when we update the content, it replaces all children involved (directly like the text nodes or indirectly like the parent of a descendant of a text node) with a single text node that holds the updated value</li>
<li>This is why updating the content of <code>textContent</code> will replace the entire content including any markup thus possibly changing your HTML web page (not just like the text)</li>
<li>There is also another property that is similar to <code>textContent</code> and that is <code>innerText</code></li>
<li>The difference is that <code>innerText</code> takes into account CSS rules and gets the text of how it actually appears on the screen</li>
<li>Thus if the CSS rule says to hide the element (e.g. <code>display: none</code>) then it won't show it, if the CSS element says uppercase but the actual HTML is in lowercase then instead of showing it lowercase like in <code>textContent</code>, it will show it in uppercase in <code>innerText</code>, if there are new line characters then it will show it in <code>innerText</code></li>
<li><code>innerText</code> will show the text just as how it appears by respecting the CSS rules</li>
<li>However, because it takes into account CSS rules it is slower than <code>textContent</code></li>
<li>You can also update <code>innerText</code> but will replace all child elements with a single text node with the value given just like <code>textContent</code></li>
</ul>
</div>
</li>

<li><a id="orgcc29b7e"></a>Section 5.3.2.3: Adding or Removing HTML Content<br />
<div class="outline-text-5" id="text-orgcc29b7e">
<ul class="org-ul">
<li>There are two very different approaches to adding and removing content from a DOM tree: <code>innerHTML</code> property and DOM manipulation</li>
<li>There are security risks associated with using <code>innerHTML</code> but <code>innerHTML</code> can be used on any element node</li>
<li><code>innerHTML</code> can be used to retrieve and replace content</li>
<li>To update an element using <code>innerHTML</code> the new content is provided as a string and it can contain markup for descendant elements</li>
<li>So to add new content for <code>innerHTML</code> you store new content (including markup) as a string in variable, you select the element whose content you want to replace, and you set the element's <code>innerHTML</code> property to be the new string</li>
<li>To remove content from <code>innerHTML</code> you either provide an empty string or if you want to remove a single descendant and not remove the rest then you provide the entire markup in the new string but now <b>without</b> the element you want to remove</li>
<li>DOM manipulation easily targets individual nodes in the DOM tree whereas <code>innerHTML</code> is better suited to updating entire fragments within a node</li>
<li>DOM manipulation can be safer than using <code>innerHTML</code> but it requires more code and can be slower</li>
<li>DOM manipulation refers to a set of DOM methods that allow you to create elements and text nodes, and then attach them to the DOM tree or remove them from the DOM tree</li>
<li>To add content (via DOM manipulation) you use a DOM method to create a new node with some stype of content, one at a time, and store it in a variable then another DOM method is used to attach the node in the correct position in the DOM tree</li>
<li>You can also remove nodes along with its content and child nodes from the DOM tree using a DOM method</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org6db8c82"></a>Section 5.3.2.3.1: Inner HTML<br />
<div class="outline-text-6" id="text-org6db8c82">
<ul class="org-ul">
<li>Using the <code>innerHTML</code> property you can access and amend the contents of an element including any child elements</li>
<li>When getting HTML from an element, the <code>innerHTML</code> property will get the content of an element and return it as one long string including markup that the element contains</li>
<li>When used to set new content for an element, it will take a string that <i>can</i> contain markup and process that string adding any elements within it to the DOM tree</li>
<li>When adding new content using <code>innerHTML</code>, be aware that one missing closing tag would throw out the design of the entire page</li>
<li>Even worse, if <code>innerHTML</code> is used to add content that your users created to a page, they could add malicious content</li>
<li>Any new elements will also be available to other scripts in the page</li>
<li>Quotation marks can be escaped whenever you need to use them such as in attributes for elements</li>
</ul>
</div>
</li>
