Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.org
*** Section 5.4.2: Validation & Templates
    - Make sure that your users can only input characters they need to use and limit where this content will be shown on the page
    - Most basic defense to these attacks is to prevent users from entering specific characters into form fields especially the characters that are not needed
    - For example, in email text boxes characters such as angled brackets, ampersands, or parentheses are not needed and should be prevented from being entered
    - This type of validation can be done in both the browser (client-side) and in the server (server-side)
    - Even websites that do allow you to enter markup limit the type of markup you can enter, for example, it may not let you enter ~<script>~ tags, elements with an event handling attribute, or it may not even let you enter a lot of HTML, it may even want to correct any markup that looks malicious
    - Malicious users will not /just/ use ~<scirpt>~ tags to try and create an XSS attack as malicious code can also live in an event handler attribute (without needing to use ~<script>~ tags)
    - XSS attacks can also be triggered by code in CSS or URLs
    - Since browsers process HTML, CSS, and JS differently then different characters can cause problems which is why you should only add content from untrusted sources as text (not markup) and place that text in elements that are visible in the viewport
    - Never place any user's content in the following places without detailed experience of the issues involved:
      - Script tags
      - HTML comments
      - Tag names
      - Attributes
      - CSS values

*** Section 5.4.3: Escaping & Controlling Markup
    - Any content generated by users that contain characters that are used in code should be escaped on the server (you must control any markup added to the page)
    - All data from untrusted sources should be escaped on the server before it is shown on the page and most server-side languages offer helper functions to strip-out or escape malicious code
    - For example instead of using the character "&" it is best to escape the character and use "&amp" for HTML
    - For JS, never include data from untrusted sources in JS which means escaping all ASCII characters with a value less than 256 that are not alphanumeric characters because that can be a security risk
    - For URLS use the JS ~encodeURIComponent()~ method to encode the user input which encodes the following characters: ~,~, ~/~, ~?~, ~:~, and more
    - When you add untrusted content to an HTML page, once it has been escaped on the server, it should still be added to the page as text and JS and jQuery both offer tools for doing this:
      - For JS use ~textContent~ and ~innerText~ instead of ~innerHTML~
      - For jQuery use ~.text()~ instead of ~.html()~
    - You can still use ~innerHTML~ or ~.html()~ but you have to make sure that you control *all* of the markup being generated (not outside users) and the actual user's content does not use the HTML methods instead the content is escaped and treated as text and use the text methods

** Section 5.5: Attribute Nodes
   - Once you have an element node, you can use other properties and methods on that element node to access and change its attributes
   - There are two steps to accessing and updating attributes:
     1. Select the element node that carries the attribute
     2. Use the dot operator to use one of the methods or properties to work with that element's attributes
   - Methods to access and change attributes of an element:
     
   | Method / Property   | Description                                      |
   |---------------------+--------------------------------------------------|
   | ~getAttribute()~    | Gets the value of an attribute                   |
   | ~hasAttribute()~    | Checks if element node has a specified attribute |
   | ~setAttribute()~    | Sets the value of an attribute                   |
   | ~removeAttribute()~ | Removes an attribute from an element node        |
   | ~className~         | Gets or sets the value of the ~class~ attribute  |
   | ~id~                | Gets or sets the value of the ~id~ attribute     |

   - Properties of an element (object) coresspond to the attributes that type of element can carry
   - For example, ~href~, ~checked~, ~title~, etc. may be properties of the element's object but may or may not have valid values depending on the type of element itself
   - Other properties include ~className~ and ~id~ which an element may or may not have
   - The ~className~ property allows you to change the value of the ~class~ attribute and if the attribute does not exist it will be created and given the specified value
   - However instead of using ~className~ we can use ~setAttribute()~ to update the value of /any/ attribute, it takes two parameters the attribute name and value for the attribute
   - Generally when there is a property for the attribute like ~className~ or ~id~ it is generally considered better to update the properties rather than use a method because the method will simply use the properties to update the value
   - Changing the ~className~ can trigger new CSS rules and change the appearance of the elements
   - By changing the value of class either through ~className~ or the method you will be overriding the entire value of the ~class~ attribute, they do not add a new value to the existing value of the ~class~ attribute
   - Instead you can add or remove idividual class names by using the property ~.classList~ and the method ~.classList.add()~ or ~.classList.remove()~
   - In jQuery you can also use the method ~.addClass()~
   - Before you work with an attribute, it is good practice to check whether it exists because this will save resources if the attribute cannot be found
   - The ~hasAttribute()~ method of any element node lets you check if an attribute exists and the attribute name is given as an argument in parentheses
   - To remove an attribute from an element, first select the element, then call ~removeAttribute()~ and it only has one parameter which is the name of the attribute to remove
   - Trying to remove an attribute that does not exist will not cause an error but it is good practice to check for its existence before attempting to remove it

** Section 5.6: Chapter Exercise
   - We are going to create a todo-list purely from JS
   - We will not have HTML elements instead we are going to create the elements in JS
   - This will help us understand the DOM tree and understand how to change the DOM tree
   - Our todo-list will have the following features:
     1. Add an item to the list
     2. Remove an item from the list
     3. Mark an item to be finished
     4. Keep track of recently deleted items
   - The entire body will be done using JS via DOM manipulation
   - [[file:./005.006.Chapter_Exercise/index.html][Here is the Todo Web App]]

