Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.html

<div id="outline-container-org37fa7e3" class="outline-4">
<h4 id="org37fa7e3">Section 5.4.2: Validation &amp; Templates</h4>
<div class="outline-text-4" id="text-org37fa7e3">
<ul class="org-ul">
<li>Make sure that your users can only input characters they need to use and limit where this content will be shown on the page</li>
<li>Most basic defense to these attacks is to prevent users from entering specific characters into form fields especially the characters that are not needed</li>
<li>For example, in email text boxes characters such as angled brackets, ampersands, or parentheses are not needed and should be prevented from being entered</li>
<li>This type of validation can be done in both the browser (client-side) and in the server (server-side)</li>
<li>Even websites that do allow you to enter markup limit the type of markup you can enter, for example, it may not let you enter <code>&lt;script&gt;</code> tags, elements with an event handling attribute, or it may not even let you enter a lot of HTML, it may even want to correct any markup that looks malicious</li>
<li>Malicious users will not <i>just</i> use <code>&lt;scirpt&gt;</code> tags to try and create an XSS attack as malicious code can also live in an event handler attribute (without needing to use <code>&lt;script&gt;</code> tags)</li>
<li>XSS attacks can also be triggered by code in CSS or URLs</li>
<li>Since browsers process HTML, CSS, and JS differently then different characters can cause problems which is why you should only add content from untrusted sources as text (not markup) and place that text in elements that are visible in the viewport</li>
<li>Never place any user's content in the following places without detailed experience of the issues involved:
<ul class="org-ul">
<li>Script tags</li>
<li>HTML comments</li>
<li>Tag names</li>
<li>Attributes</li>
<li>CSS values</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org049bd77" class="outline-4">
<h4 id="org049bd77">Section 5.4.3: Escaping &amp; Controlling Markup</h4>
<div class="outline-text-4" id="text-org049bd77">
<ul class="org-ul">
<li>Any content generated by users that contain characters that are used in code should be escaped on the server (you must control any markup added to the page)</li>
<li>All data from untrusted sources should be escaped on the server before it is shown on the page and most server-side languages offer helper functions to strip-out or escape malicious code</li>
<li>For example instead of using the character "&amp;" it is best to escape the character and use "&amp;amp" for HTML</li>
<li>For JS, never include data from untrusted sources in JS which means escaping all ASCII characters with a value less than 256 that are not alphanumeric characters because that can be a security risk</li>
<li>For URLS use the JS <code>encodeURIComponent()</code> method to encode the user input which encodes the following characters: <code>,</code>, <code>/</code>, <code>?</code>, <code>:</code>, and more</li>
<li>When you add untrusted content to an HTML page, once it has been escaped on the server, it should still be added to the page as text and JS and jQuery both offer tools for doing this:
<ul class="org-ul">
<li>For JS use <code>textContent</code> and <code>innerText</code> instead of <code>innerHTML</code></li>
<li>For jQuery use <code>.text()</code> instead of <code>.html()</code></li>
</ul></li>
<li>You can still use <code>innerHTML</code> or <code>.html()</code> but you have to make sure that you control <b>all</b> of the markup being generated (not outside users) and the actual user's content does not use the HTML methods instead the content is escaped and treated as text and use the text methods</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org31df57e" class="outline-3">
<h3 id="org31df57e">Section 5.5: Attribute Nodes</h3>
<div class="outline-text-3" id="text-org31df57e">
<ul class="org-ul">
<li>Once you have an element node, you can use other properties and methods on that element node to access and change its attributes</li>
<li>There are two steps to accessing and updating attributes:
<ol class="org-ol">
<li>Select the element node that carries the attribute</li>
<li>Use the dot operator to use one of the methods or properties to work with that element's attributes</li>
</ol></li>
<li>Methods to access and change attributes of an element:</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Method / Property</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>getAttribute()</code></td>
<td class="org-left">Gets the value of an attribute</td>
</tr>

<tr>
<td class="org-left"><code>hasAttribute()</code></td>
<td class="org-left">Checks if element node has a specified attribute</td>
</tr>

<tr>
<td class="org-left"><code>setAttribute()</code></td>
<td class="org-left">Sets the value of an attribute</td>
</tr>

<tr>
<td class="org-left"><code>removeAttribute()</code></td>
<td class="org-left">Removes an attribute from an element node</td>
</tr>

<tr>
<td class="org-left"><code>className</code></td>
<td class="org-left">Gets or sets the value of the <code>class</code> attribute</td>
</tr>

<tr>
<td class="org-left"><code>id</code></td>
<td class="org-left">Gets or sets the value of the <code>id</code> attribute</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Properties of an element (object) coresspond to the attributes that type of element can carry</li>
<li>For example, <code>href</code>, <code>checked</code>, <code>title</code>, etc. may be properties of the element's object but may or may not have valid values depending on the type of element itself</li>
<li>Other properties include <code>className</code> and <code>id</code> which an element may or may not have</li>
<li>The <code>className</code> property allows you to change the value of the <code>class</code> attribute and if the attribute does not exist it will be created and given the specified value</li>
<li>However instead of using <code>className</code> we can use <code>setAttribute()</code> to update the value of <i>any</i> attribute, it takes two parameters the attribute name and value for the attribute</li>
<li>Generally when there is a property for the attribute like <code>className</code> or <code>id</code> it is generally considered better to update the properties rather than use a method because the method will simply use the properties to update the value</li>
<li>Changing the <code>className</code> can trigger new CSS rules and change the appearance of the elements</li>
<li>By changing the value of class either through <code>className</code> or the method you will be overriding the entire value of the <code>class</code> attribute, they do not add a new value to the existing value of the <code>class</code> attribute</li>
<li>Instead you can add or remove idividual class names by using the property <code>.classList</code> and the method <code>.classList.add()</code> or <code>.classList.remove()</code></li>
<li>In jQuery you can also use the method <code>.addClass()</code></li>
<li>Before you work with an attribute, it is good practice to check whether it exists because this will save resources if the attribute cannot be found</li>
<li>The <code>hasAttribute()</code> method of any element node lets you check if an attribute exists and the attribute name is given as an argument in parentheses</li>
<li>To remove an attribute from an element, first select the element, then call <code>removeAttribute()</code> and it only has one parameter which is the name of the attribute to remove</li>
<li>Trying to remove an attribute that does not exist will not cause an error but it is good practice to check for its existence before attempting to remove it</li>
</ul>
</div>
</div>

<div id="outline-container-orgd323293" class="outline-3">
<h3 id="orgd323293">Section 5.6: Chapter Exercise</h3>
<div class="outline-text-3" id="text-orgd323293">
<ul class="org-ul">
<li>We are going to create a todo-list purely from JS</li>
<li>We will not have HTML elements instead we are going to create the elements in JS</li>
<li>This will help us understand the DOM tree and understand how to change the DOM tree</li>
<li>Our todo-list will have the following features:
<ol class="org-ol">
<li>Add an item to the list</li>
<li>Remove an item from the list</li>
<li>Mark an item to be finished</li>
<li>Keep track of recently deleted items</li>
</ol></li>
<li>The entire body will be done using JS via DOM manipulation</li>
<li><a href="./005.006.Chapter_Exercise/index.html">Here is the Todo Web App</a></li>
</ul>
</div>
</div>
