Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.org
** Section 5.7: Summary
   - The browser represents the page using a DOM tree
   - DOM trees have four main types of nodes: document nodes, element nodes, attribute nodes, and text nodes (there are more nodes but these are the main ones)
   - You can select element nodes by their id or class attributes, by tag name, or using CSS selector syntax
   - Whenever a DOM query can return more than one node it will always return a ~NodeList~
   - From an element node you can access and update its content using properties such as ~textContent~ and ~innerHTML~ or using DOM manipulation techniques
   - An element node can contain multiple text nodes and child elements that are siblings to each other
   - In older browsers, implementation of the DOM is inconsistent and is a popular reason for using jQuery; however, with modern browsers and other frameworks jQuery has decreased in popularity
   - Browsers offer tools for viewing the DOM tree
    
* Keywords
| Term                    | Definition                                                                                                                                                                                                                                                                                                                                                |
|-------------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| DOM                     | The Document Object Model (DOM) is the data representation of the objects that comprise the structure and content of a document on the web, basically, DOM is a programming interface for web documents that represent the page so that programs can change the document structure, style, and content                                                    |
| DOM Tree                | The DOM tree is a hierarchical representation of an HTML or XML document structured as a tree where each element, attribute, and text content is a node and the tree-like structure allows programming languages like JS to interact with and manipulate the web page's content, structure, and styles                                                    |
| Document Node           | The document node is the topmost root node in the DOM tree that represents the entire HTML or XML document as it is the entry point to access all elements in a web page, the document node does not represent any visible content but acts as a container for the rest of the nodes in the DOM                                                           |
| Element Node            | The element node in the DOM represents an HTML or XML element like ~<div>~, ~<p>~, and so on as it directly corresponds to the tags in the HTML or XML document, these elements may have attributes, child nodes, and text content                                                                                                                        |
| Attribute Node          | The attribute node in the DOM represents an attribute of an HTML or XML element such as ~class~, ~id~, ~href~, etc. the element node can have zero or more attribute nodes and these attribute nodes are *not* considered to be child nodes of the element node                                                                                           |
| Text Node               | Text nodes in the DOM represent the actual text content inside an element or attribute (not the element or attribute itself), these text nodes are always leaf node and only contain the text value under the property ~nodeValue~                                                                                                                        |
| ~.innerHTML~ Property   | Retrieves and sets all the HTML content inside the element, the value is a string with HTML markup so you can retrieve this string or you can set a new string and it will process HTML markup and replace all child elements with the new HTML given                                                                                                     |
| ~.innerText~ Property   | ~innerText~ retrieves text from all child elements and stores it into a string just like how it is displayed depending on the CSS rules, if the CSS rule says the text is uppercase then the string will be in uppercase; it does not have markup and you can set the value of ~innerText~ but it will replace all child elements with a single text node |
| ~.textContent~ Property | ~textContent~ is similar to ~innerText~ as it gets all the text from the child elements but it only gets the text from the HTML, if any CSS rule is applicable it will be ignored in the string, you can also replace the string but it will replace all child elements with a single text node with the value given                                      |

