Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.html

<div id="outline-container-org6371e74" class="outline-3">
<h3 id="org6371e74">Section 5.7: Summary</h3>
<div class="outline-text-3" id="text-org6371e74">
<ul class="org-ul">
<li>The browser represents the page using a DOM tree</li>
<li>DOM trees have four main types of nodes: document nodes, element nodes, attribute nodes, and text nodes (there are more nodes but these are the main ones)</li>
<li>You can select element nodes by their id or class attributes, by tag name, or using CSS selector syntax</li>
<li>Whenever a DOM query can return more than one node it will always return a <code>NodeList</code></li>
<li>From an element node you can access and update its content using properties such as <code>textContent</code> and <code>innerHTML</code> or using DOM manipulation techniques</li>
<li>An element node can contain multiple text nodes and child elements that are siblings to each other</li>
<li>In older browsers, implementation of the DOM is inconsistent and is a popular reason for using jQuery; however, with modern browsers and other frameworks jQuery has decreased in popularity</li>
<li>Browsers offer tools for viewing the DOM tree</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org8310c0b" class="outline-2">
<h2 id="org8310c0b">Keywords</h2>
<div class="outline-text-2" id="text-org8310c0b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">DOM</td>
<td class="org-left">The Document Object Model (DOM) is the data representation of the objects that comprise the structure and content of a document on the web, basically, DOM is a programming interface for web documents that represent the page so that programs can change the document structure, style, and content</td>
</tr>

<tr>
<td class="org-left">DOM Tree</td>
<td class="org-left">The DOM tree is a hierarchical representation of an HTML or XML document structured as a tree where each element, attribute, and text content is a node and the tree-like structure allows programming languages like JS to interact with and manipulate the web page's content, structure, and styles</td>
</tr>

<tr>
<td class="org-left">Document Node</td>
<td class="org-left">The document node is the topmost root node in the DOM tree that represents the entire HTML or XML document as it is the entry point to access all elements in a web page, the document node does not represent any visible content but acts as a container for the rest of the nodes in the DOM</td>
</tr>

<tr>
<td class="org-left">Element Node</td>
<td class="org-left">The element node in the DOM represents an HTML or XML element like <code>&lt;div&gt;</code>, <code>&lt;p&gt;</code>, and so on as it directly corresponds to the tags in the HTML or XML document, these elements may have attributes, child nodes, and text content</td>
</tr>

<tr>
<td class="org-left">Attribute Node</td>
<td class="org-left">The attribute node in the DOM represents an attribute of an HTML or XML element such as <code>class</code>, <code>id</code>, <code>href</code>, etc. the element node can have zero or more attribute nodes and these attribute nodes are <b>not</b> considered to be child nodes of the element node</td>
</tr>

<tr>
<td class="org-left">Text Node</td>
<td class="org-left">Text nodes in the DOM represent the actual text content inside an element or attribute (not the element or attribute itself), these text nodes are always leaf node and only contain the text value under the property <code>nodeValue</code></td>
</tr>

<tr>
<td class="org-left"><code>.innerHTML</code> Property</td>
<td class="org-left">Retrieves and sets all the HTML content inside the element, the value is a string with HTML markup so you can retrieve this string or you can set a new string and it will process HTML markup and replace all child elements with the new HTML given</td>
</tr>

<tr>
<td class="org-left"><code>.innerText</code> Property</td>
<td class="org-left"><code>innerText</code> retrieves text from all child elements and stores it into a string just like how it is displayed depending on the CSS rules, if the CSS rule says the text is uppercase then the string will be in uppercase; it does not have markup and you can set the value of <code>innerText</code> but it will replace all child elements with a single text node</td>
</tr>

<tr>
<td class="org-left"><code>.textContent</code> Property</td>
<td class="org-left"><code>textContent</code> is similar to <code>innerText</code> as it gets all the text from the child elements but it only gets the text from the HTML, if any CSS rule is applicable it will be ignored in the string, you can also replace the string but it will replace all child elements with a single text node with the value given</td>
</tr>
</tbody>
</table>
</div>
</div>
