Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.org
* Questions
  - *Q*: How does DOM treat whitespaces?
         - DOM creates text nodes for whitespace characters
	 - So if you have the following:
	 #+BEGIN_SRC html
	   <div>
	     <p>Hello World</p>
	   </div>
	 #+END_SRC
	 - It will create a element node for ~div~ then it will create 3 child nodes, one text node for the first newline character, the second node for the element ~p~, and the third node for the next newline character
	 - So whitespace characters are preserved in DOM and treated as part of the content in the text node
	 - The actual content in text nodes is preserved exactly as it appears in the HTML
	   
  - *Q*: How does DOM treat attributes?
         - DOM creates nodes for the attributes but these attributes are not children of the element node
	 - Instead attribute nodes are stored as part of the element node
	 - Attributes are treated as name-value pairs with the name of the attribute and its value
	 - Attribute nodes are case-insensitive and again they are not children of the element but part of the element as properties
	   
  - *Q*: Which nodes are leaf nodes and why isn't attribute nodes considered leaf nodes?
         - The nodes that can be leaf nodes are text nodes, comment nodes, and empty elements (no children)
         - Attribute nodes are not considered leaf nodes because attributes are not part of the child-node hierarchy because they are associated with the element node itself as a property / metadata
	 - Since attribute nodes are not children of the element, they do not appear in the node's child list and thus not part of the document's tree structure because they are a part of the element itself
	 - So attributes cannot be leaf nodes because they are not even considered as part of the tree instead they are considered as properties of the element itself
	   
  - *Q*: Is there a function or property that gets the text node directly?
         - No there is not a direct way to get the text node
	 - Instead you would have to use other methods / properties
	 - You could use the child nodes of the element, iterate through the list, and find the node whose's type is a text node
	 - You could use the property ~.textContent~ to change the text content inside the element

  - *Q*: What is the difference between ~.innerHTML~, ~.innerText~, and ~.textContent~?
         - The ~.innerHTML~ property allows you to get or set the HTML content inside an element with a string containing HTML markup
	 - This string is processed by HTML to add elements to the DOM
	 - ~.innerText~ returns or sets the visible text content from all its children as a string as it appears after the CSS rules have been applied
	 - So if some text is hidden by CSS then the text will not show up, if some text is uppercased by CSS then the string will return text uppercased
	 - ~.innerText~ does not contain HTML markup, it only returns plain text
	 - ~.textContent~ is similar to ~.innerText~ but it does not consider CSS styles so it will return the text of all children elements as plain text without any CSS changes just like how it appears in HTML
	 - ~.textContent~ does not contain HTML markup
	 - So ~.innerHTML~ gets and sets HTML markup, ~.innerText~ gets and sets plain text with CSS stylings, and ~.textContent~ gets and sets the raw text content without any CSS stylings
	   
  - *Q*: What is the difference between live ~NodeList~ and static ~NodeList~?
         - Both live ~NodeList~ and static ~NodeList~ are ~NodeList~ which is a collection of nodes but the only difference between the two is how they update in response to changes in the DOM tree
	 - For live ~NodeList~ when the DOM is changed and modified, the ~NodeList~ will have those changes in real-time without having to do anything
	 - The live ~NodeList~ will reflect the changes in DOM dynamically and is always kept in sync with the current state of the document
	 - Methods that return live ~NodeList~ are: ~getElementsByTagName()~ and ~getElementsByClassName()~
	 - Static ~NodeList~ is a snapshot of the nodes that match the query when the ~NodeList~ was created
	 - Once a static ~NodeList~ is created, it does not update if the DOM changes, the content of a NodeList is frozen at the time it was created
	 - The method that returns static ~NodeList~ is ~querySelectorAll()~ 
	   
  - *Q*: Do all scripts use the same DOM tree, so if one script affects the DOM tree does the other script see the changes?
         - There is a single DOM object for one page, so all scripts running in the web page will have the same shared DOM
	 - Thus if one script changes the DOM, those changes will be reflected in the DOM tree and the other script running on the same page will see the updated DOM
	 - The DOM is a global representation of the HTML document in the browser so all scripts on the page interact with the same DOM
	 - Thus any changes to DOM is visible to all scripts
