Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.html

<div id="outline-container-orgac53bab" class="outline-2">
<h2 id="orgac53bab">Questions</h2>
<div class="outline-text-2" id="text-orgac53bab">
<ul class="org-ul">
<li><p>
<b>Q</b>: How does DOM treat whitespaces?
</p>
<ul class="org-ul">
<li>DOM creates text nodes for whitespace characters</li>
<li>So if you have the following:</li>
</ul>
<div class="org-src-container">
<pre class="src src-html">&lt;div&gt;
  &lt;p&gt;Hello World&lt;/p&gt;
&lt;/div&gt;
</pre>
</div>
<ul class="org-ul">
<li>It will create a element node for <code>div</code> then it will create 3 child nodes, one text node for the first newline character, the second node for the element <code>p</code>, and the third node for the next newline character</li>
<li>So whitespace characters are preserved in DOM and treated as part of the content in the text node</li>
<li>The actual content in text nodes is preserved exactly as it appears in the HTML</li>
</ul></li>

<li><b>Q</b>: How does DOM treat attributes?
<ul class="org-ul">
<li>DOM creates nodes for the attributes but these attributes are not children of the element node</li>
<li>Instead attribute nodes are stored as part of the element node</li>
<li>Attributes are treated as name-value pairs with the name of the attribute and its value</li>
<li>Attribute nodes are case-insensitive and again they are not children of the element but part of the element as properties</li>
</ul></li>

<li><b>Q</b>: Which nodes are leaf nodes and why isn't attribute nodes considered leaf nodes?
<ul class="org-ul">
<li>The nodes that can be leaf nodes are text nodes, comment nodes, and empty elements (no children)</li>
<li>Attribute nodes are not considered leaf nodes because attributes are not part of the child-node hierarchy because they are associated with the element node itself as a property / metadata</li>
<li>Since attribute nodes are not children of the element, they do not appear in the node's child list and thus not part of the document's tree structure because they are a part of the element itself</li>
<li>So attributes cannot be leaf nodes because they are not even considered as part of the tree instead they are considered as properties of the element itself</li>
</ul></li>

<li><b>Q</b>: Is there a function or property that gets the text node directly?
<ul class="org-ul">
<li>No there is not a direct way to get the text node</li>
<li>Instead you would have to use other methods / properties</li>
<li>You could use the child nodes of the element, iterate through the list, and find the node whose's type is a text node</li>
<li>You could use the property <code>.textContent</code> to change the text content inside the element</li>
</ul></li>

<li><b>Q</b>: What is the difference between <code>.innerHTML</code>, <code>.innerText</code>, and <code>.textContent</code>?
<ul class="org-ul">
<li>The <code>.innerHTML</code> property allows you to get or set the HTML content inside an element with a string containing HTML markup</li>
<li>This string is processed by HTML to add elements to the DOM</li>
<li><code>.innerText</code> returns or sets the visible text content from all its children as a string as it appears after the CSS rules have been applied</li>
<li>So if some text is hidden by CSS then the text will not show up, if some text is uppercased by CSS then the string will return text uppercased</li>
<li><code>.innerText</code> does not contain HTML markup, it only returns plain text</li>
<li><code>.textContent</code> is similar to <code>.innerText</code> but it does not consider CSS styles so it will return the text of all children elements as plain text without any CSS changes just like how it appears in HTML</li>
<li><code>.textContent</code> does not contain HTML markup</li>
<li>So <code>.innerHTML</code> gets and sets HTML markup, <code>.innerText</code> gets and sets plain text with CSS stylings, and <code>.textContent</code> gets and sets the raw text content without any CSS stylings</li>
</ul></li>

<li><b>Q</b>: What is the difference between live <code>NodeList</code> and static <code>NodeList</code>?
<ul class="org-ul">
<li>Both live <code>NodeList</code> and static <code>NodeList</code> are <code>NodeList</code> which is a collection of nodes but the only difference between the two is how they update in response to changes in the DOM tree</li>
<li>For live <code>NodeList</code> when the DOM is changed and modified, the <code>NodeList</code> will have those changes in real-time without having to do anything</li>
<li>The live <code>NodeList</code> will reflect the changes in DOM dynamically and is always kept in sync with the current state of the document</li>
<li>Methods that return live <code>NodeList</code> are: <code>getElementsByTagName()</code> and <code>getElementsByClassName()</code></li>
<li>Static <code>NodeList</code> is a snapshot of the nodes that match the query when the <code>NodeList</code> was created</li>
<li>Once a static <code>NodeList</code> is created, it does not update if the DOM changes, the content of a NodeList is frozen at the time it was created</li>
<li>The method that returns static <code>NodeList</code> is <code>querySelectorAll()</code></li>
</ul></li>

<li><b>Q</b>: Do all scripts use the same DOM tree, so if one script affects the DOM tree does the other script see the changes?
<ul class="org-ul">
<li>There is a single DOM object for one page, so all scripts running in the web page will have the same shared DOM</li>
<li>Thus if one script changes the DOM, those changes will be reflected in the DOM tree and the other script running on the same page will see the updated DOM</li>
<li>The DOM is a global representation of the HTML document in the browser so all scripts on the page interact with the same DOM</li>
<li>Thus any changes to DOM is visible to all scripts</li>
</ul></li>
</ul>
</div>
</div>
