Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.org
* Summary
  - The Document Object Model (DOM) specifies how browsers should create a model of an HTML page and how JS can access and update the contents of a web page while it is in the browser window
  - DOM is not part of HTML or JS instead it is implemented by all major browsers that make the model of the HTML page and based on the model allows JS to access and change the HTML page
  - When a page is loaded the browser creates a model of the page in memory and DOM specifies the way in which the browser should structure this model using a DOM tree
  - DOM defines methods and properties to access and update each object in the DOM tree which is why the DOM is sometimes referred to as an application programming interface (API)
  - The DOM tree is stored in the browser's memory and it consists of four main types of nodes: document nodes, element nodes, attribute nodes, and text nodes
  - The document node is the root node (~document~ node) and it represents the entire page
  - Every tree node in the DOM tree is an object even the leaf nodes
  - Text nodes are created for whitespace characters
  - Attribute nodes are not part of the hierarchical tree structure instead the attribute nodes are part (properties) of the element nodes
  - To retrieve nodes (objects) from the DOM tree there are many ways, you can use methods (DOM queries) or properties to traverse the DOM tree
  - To retrieve single nodes using the DOM queries you use the following methods: ~getElementByID()~ and ~querySelector()~
  - To retrieve multiple nodes using DOM queries you use the following methods: ~getElementsByClassName()~, ~getElementsByTagName()~, and ~querySelectorAll()~
  - The methods that retrieve multiple nodes will return a ~NodeList~
  - The ~NodeList~ may be live or static depending on the method used
  - Methods that start like ~getElementsBy~ will return live ~NodeList~ that means any changes to the DOM will automatically be reflected in the ~NodeList~ if applicable
  - The method ~querySelectorAll()~ returns static ~NodeList~ and static lists do not change if the DOM changes instead they capture or store the query results of the DOM query at the time of the query and does not change after if the DOM changes
  - You can also traverse through the nodes by using the properties ~parentNode~, ~previousSibling~, ~nextSibling~, ~firstChild~, and ~lastChild~
  - To access the contents of a node you can use the properties and methods of the node
  - To access a node's text, you can access it's child text node, however there is no property or function that directly gives you the text node instead you will need to use other methods / properties to get the text node
  - Once you have access to the text node you can use the property ~nodeValue~ to get the text from the text node
  - Some elements may have multiple text nodes so you will have to go through each one to get the full text
  - Instead you can use the property ~.textContent~ of the element to retireve or set the text from all children of the element
  - ~textContent~ will retrieve all text as a string with plain text
  - You could also use ~.innerText~, it is similar to ~textContent~ in the sense that you can replace or retrieve the value but it will reflect any CSS stylings such as hidden text will be hidden, uppercase text will be uppercased, etc.
  - Or you could use ~.innerHTML~ but the string stored in ~.innerHTML~ is the actual HTML markup with the tags so if you were to replace the value with a string, the string may contain HTML markup and DOM will reflect the changes added / removed from ~.innerHTML~ because it understands to process the string as HTML markup
  - However ~.innerHTML~ can lead to security risks (due to being able to add malicious HTML with script tags) so it is best to avoid ~.innerHTML~ if possible and if we need to use it then we should be the only person who uses ~.innerHTML~
  - Some websites receive user input so always validate input in the client-side and server-side, never add user input into script tags, HTML comments, tag names, attributes, CSS values, and always escape your strings on the server before the browser processes it
  - There are functions to create and remove nodes from the DOM tree using the ~document~ object
  - You can use the functions ~createElement()~ and ~createTextNode()~ to create nodes and then use the methods ~appendChild()~ or ~insertBefore()~ to add nodes to existing nodes
  - You can remove nodes by the functions ~removeChild()~
  - Also just because you created an element or node, does *not* mean you have added the node to the DOM tree
  - To add newly created objects (nodes) to the DOM tree you need to append it as a child to an already existing node in the DOM tree
  - If you append the newly created node to another node that is not in the DOM tree then both nodes do not exist in the DOM tree and it will not show up in the web page
  - You have to add the newly created node to a node that is already present in the DOM tree so it can be successfully added to the DOM tree and shown in the page
  - To add new elements in HTML you can use ~.innerHTML~, DOM manipulation with the methods shown above, or with ~document.write()~
  - Although DOM manipulation may be slower and requires more code it may be more secure than ~innerHTML~ and ~document.write()~ has since been deprecated and should no longer be used
  - Finally, attribute nodes are not child nodes of the element but part of the element itself
  - Attribute nodes can be retrieved, checked for, set, and removed using the following functions: ~getAttribute()~, ~hasAttribute()~, ~setAttribute()~, and ~removeAttribute()~
  - However, depending on the object you may have access to the attribute directly, for example, for links instead of saying ~setAttribute("href", "www.example.com")~ you have be able to access it using ~.href~
  - It is better to use these properties directly if possible because it is faster and because behind the scenes the methods shown above regarding attributes use these same properties to set attributes, check attributes, get attributes, and remove attributes
    
* Resources
  - https://javascript.info/dom-nodes
