Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model/005.000.Notes.html
<div id="outline-container-orgf0cf0ba" class="outline-2">
<h2 id="orgf0cf0ba">Summary</h2>
<div class="outline-text-2" id="text-orgf0cf0ba">
<ul class="org-ul">
<li>The Document Object Model (DOM) specifies how browsers should create a model of an HTML page and how JS can access and update the contents of a web page while it is in the browser window</li>
<li>DOM is not part of HTML or JS instead it is implemented by all major browsers that make the model of the HTML page and based on the model allows JS to access and change the HTML page</li>
<li>When a page is loaded the browser creates a model of the page in memory and DOM specifies the way in which the browser should structure this model using a DOM tree</li>
<li>DOM defines methods and properties to access and update each object in the DOM tree which is why the DOM is sometimes referred to as an application programming interface (API)</li>
<li>The DOM tree is stored in the browser's memory and it consists of four main types of nodes: document nodes, element nodes, attribute nodes, and text nodes</li>
<li>The document node is the root node (<code>document</code> node) and it represents the entire page</li>
<li>Every tree node in the DOM tree is an object even the leaf nodes</li>
<li>Text nodes are created for whitespace characters</li>
<li>Attribute nodes are not part of the hierarchical tree structure instead the attribute nodes are part (properties) of the element nodes</li>
<li>To retrieve nodes (objects) from the DOM tree there are many ways, you can use methods (DOM queries) or properties to traverse the DOM tree</li>
<li>To retrieve single nodes using the DOM queries you use the following methods: <code>getElementByID()</code> and <code>querySelector()</code></li>
<li>To retrieve multiple nodes using DOM queries you use the following methods: <code>getElementsByClassName()</code>, <code>getElementsByTagName()</code>, and <code>querySelectorAll()</code></li>
<li>The methods that retrieve multiple nodes will return a <code>NodeList</code></li>
<li>The <code>NodeList</code> may be live or static depending on the method used</li>
<li>Methods that start like <code>getElementsBy</code> will return live <code>NodeList</code> that means any changes to the DOM will automatically be reflected in the <code>NodeList</code> if applicable</li>
<li>The method <code>querySelectorAll()</code> returns static <code>NodeList</code> and static lists do not change if the DOM changes instead they capture or store the query results of the DOM query at the time of the query and does not change after if the DOM changes</li>
<li>You can also traverse through the nodes by using the properties <code>parentNode</code>, <code>previousSibling</code>, <code>nextSibling</code>, <code>firstChild</code>, and <code>lastChild</code></li>
<li>To access the contents of a node you can use the properties and methods of the node</li>
<li>To access a node's text, you can access it's child text node, however there is no property or function that directly gives you the text node instead you will need to use other methods / properties to get the text node</li>
<li>Once you have access to the text node you can use the property <code>nodeValue</code> to get the text from the text node</li>
<li>Some elements may have multiple text nodes so you will have to go through each one to get the full text</li>
<li>Instead you can use the property <code>.textContent</code> of the element to retireve or set the text from all children of the element</li>
<li><code>textContent</code> will retrieve all text as a string with plain text</li>
<li>You could also use <code>.innerText</code>, it is similar to <code>textContent</code> in the sense that you can replace or retrieve the value but it will reflect any CSS stylings such as hidden text will be hidden, uppercase text will be uppercased, etc.</li>
<li>Or you could use <code>.innerHTML</code> but the string stored in <code>.innerHTML</code> is the actual HTML markup with the tags so if you were to replace the value with a string, the string may contain HTML markup and DOM will reflect the changes added / removed from <code>.innerHTML</code> because it understands to process the string as HTML markup</li>
<li>However <code>.innerHTML</code> can lead to security risks (due to being able to add malicious HTML with script tags) so it is best to avoid <code>.innerHTML</code> if possible and if we need to use it then we should be the only person who uses <code>.innerHTML</code></li>
<li>Some websites receive user input so always validate input in the client-side and server-side, never add user input into script tags, HTML comments, tag names, attributes, CSS values, and always escape your strings on the server before the browser processes it</li>
<li>There are functions to create and remove nodes from the DOM tree using the <code>document</code> object</li>
<li>You can use the functions <code>createElement()</code> and <code>createTextNode()</code> to create nodes and then use the methods <code>appendChild()</code> or <code>insertBefore()</code> to add nodes to existing nodes</li>
<li>You can remove nodes by the functions <code>removeChild()</code></li>
<li>Also just because you created an element or node, does <b>not</b> mean you have added the node to the DOM tree</li>
<li>To add newly created objects (nodes) to the DOM tree you need to append it as a child to an already existing node in the DOM tree</li>
<li>If you append the newly created node to another node that is not in the DOM tree then both nodes do not exist in the DOM tree and it will not show up in the web page</li>
<li>You have to add the newly created node to a node that is already present in the DOM tree so it can be successfully added to the DOM tree and shown in the page</li>
<li>To add new elements in HTML you can use <code>.innerHTML</code>, DOM manipulation with the methods shown above, or with <code>document.write()</code></li>
<li>Although DOM manipulation may be slower and requires more code it may be more secure than <code>innerHTML</code> and <code>document.write()</code> has since been deprecated and should no longer be used</li>
<li>Finally, attribute nodes are not child nodes of the element but part of the element itself</li>
<li>Attribute nodes can be retrieved, checked for, set, and removed using the following functions: <code>getAttribute()</code>, <code>hasAttribute()</code>, <code>setAttribute()</code>, and <code>removeAttribute()</code></li>
<li>However, depending on the object you may have access to the attribute directly, for example, for links instead of saying <code>setAttribute("href", "www.example.com")</code> you have be able to access it using <code>.href</code></li>
<li>It is better to use these properties directly if possible because it is faster and because behind the scenes the methods shown above regarding attributes use these same properties to set attributes, check attributes, get attributes, and remove attributes</li>
</ul>
</div>
</div>

<div id="outline-container-org6acee77" class="outline-2">
<h2 id="org6acee77">Resources</h2>
<div class="outline-text-2" id="text-org6acee77">
<ul class="org-ul">
<li><a href="https://javascript.info/dom-nodes">https://javascript.info/dom-nodes</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
